Velenstin/NRP/nRF5_SDK_15.0.0_NRP/examples/ble_peripheral/ble_app_uart/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (m_ble_nus_max_data_len)))
            {
                NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                NRF_LOG_HEXDUMP_DEBUG(data_array, index);

                do
                {
                    uint16_t length = (uint16_t)index;
                    err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                    if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_BUSY) &&
                         (err_code != NRF_ERROR_NOT_FOUND) )
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                } while (err_code == NRF_ERROR_BUSY);

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

//JACK-
//    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);

//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);
//JACK END
	
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
//JACK+
	  uint32_t err_code;
	  uint32_t MAC1,MAC2;
	  ble_gap_conn_sec_mode_t sec_mode;
	
		ble_gap_addr_t gap_addr;
		int32_t *ptr_1mac=(int32_t *)0x10001080;
	  int32_t *ptr_2mac=(int32_t *)0x10001084; 	
//JACK END
	
    // Initialize.
//    uart_init();		//JACK-
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();

    gap_params_init();
    gatt_init();
    services_init();
		
//JACK+	
    MAC1 = (uint32_t)(*ptr_1mac);
	  MAC2 = (uint32_t)(*ptr_2mac);

		gap_addr.addr[0] =(uint8_t)(MAC2>>0);
		gap_addr.addr[1] = (uint8_t)(MAC2>>8);  
		gap_addr.addr[2] = (uint8_t)(MAC2>>16);  
		gap_addr.addr[3] = (uint8_t)(MAC1>>0);  
		gap_addr.addr[4] = (uint8_t)(MAC1>>8);  
		gap_addr.addr[5] = (uint8_t)((MAC1>>16) | 0xc0); 

		gap_addr.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
		err_code = sd_ble_gap_addr_set(&gap_addr);
		APP_ERROR_CHECK(err_code);
//JACK END		
		
    advertising_init();
    conn_params_init();

//JACK+
	  nrf_gpio_cfg_input(29,NRF_GPIO_PIN_NOPULL);
	  sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
//JACK END	

    // Start execution.
//    printf("\r\nUART started.\r\n");		//JACK-
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
	
//JACK+
    err_code = app_timer_create(&m_wdt_tmr, APP_TIMER_MODE_REPEATED, wdt_handler);
		APP_ERROR_CHECK(err_code);
		
    nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
		nrf_drv_wdt_enable();	
		
		err_code = app_timer_start(m_wdt_tmr, APP_TIMER_TICKS(500), NULL);
		APP_ERROR_CHECK(err_code);
//JACK END

    // Enter main loop.
    for (;;)
    {
//JACK+			
			  if (nrf_gpio_pin_read(29) == 0)
				{
					if (A_mode == false)
					{
						A_mode = true;
						B_mode = false;
						
						err_code = sd_ble_gap_adv_stop(m_advertising.adv_handle);
						APP_ERROR_CHECK(err_code);
						
						err_code = sd_ble_gap_device_name_set(&sec_mode,(const uint8_t *)"NRP V0",6);
						APP_ERROR_CHECK(err_code);	
          
            advertising_init();
						advertising_start();
					}
				}
				else
				{
					if (B_mode == false)
					{
						B_mode = true;
						A_mode = false;
						
						err_code = sd_ble_gap_adv_stop(m_advertising.adv_handle);
						APP_ERROR_CHECK(err_code);						
						
						err_code = sd_ble_gap_device_name_set(&sec_mode,(const uint8_t *)"NRP V1",6);
						APP_ERROR_CHECK(err_code);

            advertising_init();	
						advertising_start(); 
					}					
				}
				
				nrf_drv_wdt_feed();
//JACK END				
				
        idle_state_handle();
    }
}


/**
 * @}
 */
